In [2]:
numbers = [1,2,3,4,5]

for i in numbers:
    print(i)

1
2
3
4
5

In [5]:
simpsons = {'Dad':'Homer'
            ,'Mum' : 'Marge'
            ,'Baby' : 'Maggie'}
print(simpsons.items())

for family_member, name in simpsons.items():
    print(f'{name} is the {family_member}')

dict_items([('Dad', 'Homer'), ('Mum', 'Marge'), ('Baby', 'Maggie')])
Homer is the Dad
Marge is the Mum
Maggie is the Baby

In [21]:
fruits = {'Banana':'Yellow',
            'Apple':'Green',
            'Persimmon':'Orange'}
print(fruits.items())

for fruit_type, fruit_colour in fruits.items():
    print(f'{fruit_type}s are {fruit_colour}')

dict_items([('Banana', 'Yellow'), ('Apple', 'Green'), ('Persimmon', 'Orange')])
Bananas are Yellow
Apples are Green
Persimmons are Orange

In [27]:
simpsons_side_characters = ['Barney', 'Ned', 'Krusty', 'Sideshow Bob']
print(simpsons_side_characters)

for i in enumerate(simpsons_side_characters): #enumerate uses the index location. Indexing starts at 0
    print(i)

for i, name in enumerate(simpsons_side_characters):
    simpsons_side_characters[i] = f'{name} Simpson'
print(simpsons_side_characters)

['Barney', 'Ned', 'Krusty', 'Sideshow Bob']
(0, 'Barney')
(1, 'Ned')
(2, 'Krusty')
(3, 'Sideshow Bob')
['Barney Simpson', 'Ned Simpson', 'Krusty Simpson', 'Sideshow Bob Simpson']

In [41]:
import pandas as pd

fam_1 = pd.DataFrame({'Name':['Vicki', 'Henry', 'Heidi'],
                        'Role':['Wife', 'Son', 'Daughter']})
fam_2 = pd.DataFrame({'Name':['Clare', 'Edward', 'Sofia'],
                        'Role':['Sister', 'Bro-in-Law', 'Niece']})
#print(fam_1)
#print(fam_2)

fam_dict = {'Dataframe 1' : fam_1,
            'Dataframe 2' : fam_2}
#print(fam_dict)

#for k, v in fam_dict.items():
#    print(k)
#    print(v)

for k, v in fam_dict.items():
    v['Origin'] = k

fam_dict['Dataframe 1']

    Name      Role       Origin
0  Vicki      Wife  Dataframe 1
1  Henry       Son  Dataframe 1
2  Heidi  Daughter  Dataframe 1

In [48]:
child_identifiers = pd.DataFrame({'child_id':['child 1', 'child 2', 'child 3', 'child 4'],
                                    'age_first_contact':[6, 10, 12, 13],
                                    'gender':['M', 'M', 'M', 'F']
                                    })
#print(child_identifiers)

nhs_numbers = pd.DataFrame({'child_id':['child 1', 'child 2', 'child 3', 'child 4'],
                            'nhs_number':[1234,4567,7899,7342]                            
                                })
#print(nhs_numbers)

ident_nhs = child_identifiers.merge(nhs_numbers, how='left', left_on='child_id', right_on='child_id') #left on=['child_id', 'DOB'] << example of joining on two arguments

print(ident_nhs)

  child_id  age_first_contact gender  nhs_number
0  child 1                  6      M        1234
1  child 2                 10      M        4567
2  child 3                 12      M        7899
3  child 4                 13      F        7342

In [56]:
#print(fam_dict)

fam_dobs = pd.DataFrame({'Name':['Vicki', 'Henry', 'Heidi'],
                            'DOB':['27/02/1982', '17/11/2008', '05/07/2011']
                        })
#print(fam_dobs)

fam_1_with_dobs = fam_1.merge(fam_dobs, how='left', left_on='Name', right_on='Name')

print(fam_1_with_dobs)

    Name      Role       Origin         DOB
0  Vicki      Wife  Dataframe 1  27/02/1982
1  Henry       Son  Dataframe 1  17/11/2008
2  Heidi  Daughter  Dataframe 1  05/07/2011

In [2]:
import pandas as pd

In [14]:
child_return = pd.DataFrame({'child_id':['child1', 'child2', 'child3', 'child4'],
                                    'gender':['0', '1', '2', '7'], #recorded as string
                                    'date_of_birth':['05/05/2015', '12/12/2020', '01/01/2000', '09/12/2017'],
                                    'ethnicity':['BANG', 'WOTH', 'MOTH', 'WIRI'],
                                    'place':['B1', 'T1', 'X2', 'W1']
                                    })
#print(child_return)

child_return['date_of_birth'] = pd.to_datetime(child_return['date_of_birth'], format='%d/%m/%Y')

print(child_return)

#child_return.info()

  child_id gender date_of_birth ethnicity place
0   child1      0    2015-05-05      BANG    B1
1   child2      1    2020-12-12      WOTH    T1
2   child3      2    2000-01-01      MOTH    X2
3   child4      7    2017-12-09      WIRI    W1

In [19]:
corporation = [{'Name':'Will LP',
                'Salary':'10000',
                'Job Title':'Employee'},
                {'Name':'Annie LP',
                'Salary':'15000',
                'Job Title':'CEO'},
                {'Name':'Naiomi LP',
                'Salary':'90000',
                'Job Title':'VP'},
                {'Name':'Luke V',
                'Salary':'45000',
                'Job Title':'Teach Lead'},
                {'Name':'Matt K',
                'Salary':'30000',
                'Job Title':'Comms'},
                {'Name':'Hannah K',
                'Salary':'38000',
                'Job Title':'HR'},]

corp_df = pd.DataFrame(corporation)


corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020', '23/12/1989', '10/10/2010', '17/12/2021']

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')

corp_df['Salary'] = corp_df['Salary'].astype('int')

corp_df

        Name  Salary   Job Title Date Started
0    Will LP   10000    Employee   1993-12-05
1   Annie LP   15000         CEO   2000-01-01
2  Naiomi LP   90000          VP   2020-01-01
3     Luke V   45000  Teach Lead   1989-12-23
4     Matt K   30000       Comms   2010-10-10
5   Hannah K   38000          HR   2021-12-17

In [22]:
# equal               ==
# not equal           !=
# less than           <
# greater than        >
# greater or equal    >=
# less or equal       <=
# not                   ~

selection = corp_df['Salary'] > 40000 #mask
#selection

over_40k = corp_df[selection] #pass mask to dataframe
over_40k

        Name  Salary   Job Title Date Started
2  Naiomi LP   90000          VP   2020-01-01
3     Luke V   45000  Teach Lead   1989-12-23

In [35]:
dq_incorrect_gender = child_return[child_return['gender'] == '7']
print(dq_incorrect_gender)

dq_correct_gender = child_return[child_return['gender'] != '7']
print(dq_correct_gender)

dq_incorrect_ethnicity = child_return[child_return['ethnicity'] == 'BANG']
print(dq_incorrect_ethnicity)

dq_incorrect_ethnicity = child_return[child_return['ethnicity'] != 'BANG']
print(dq_incorrect_ethnicity)

  child_id gender date_of_birth ethnicity place
3   child4      7    2017-12-09      WIRI    W1
  child_id gender date_of_birth ethnicity place
0   child1      0    2015-05-05      BANG    B1
1   child2      1    2020-12-12      WOTH    T1
2   child3      2    2000-01-01      MOTH    X2
  child_id gender date_of_birth ethnicity place
0   child1      0    2015-05-05      BANG    B1
  child_id gender date_of_birth ethnicity place
1   child2      1    2020-12-12      WOTH    T1
2   child3      2    2000-01-01      MOTH    X2
3   child4      7    2017-12-09      WIRI    W1

In [38]:
#better version of above

mask = child_return['gender'] == '7'
wrong_gender_codes = child_return[mask]
print(wrong_gender_codes)

correct_gender_codes = child_return[~mask]
print(correct_gender_codes)

mask = child_return['ethnicity'] == 'BANG'
wrong_eth_codes = child_return[mask]
print(wrong_eth_codes)

correct_eth_codes = child_return[~mask]
print(correct_eth_codes)

  child_id gender date_of_birth ethnicity place
3   child4      7    2017-12-09      WIRI    W1
  child_id gender date_of_birth ethnicity place
0   child1      0    2015-05-05      BANG    B1
1   child2      1    2020-12-12      WOTH    T1
2   child3      2    2000-01-01      MOTH    X2
  child_id gender date_of_birth ethnicity place
0   child1      0    2015-05-05      BANG    B1
  child_id gender date_of_birth ethnicity place
1   child2      1    2020-12-12      WOTH    T1
2   child3      2    2000-01-01      MOTH    X2
3   child4      7    2017-12-09      WIRI    W1

In [39]:
answers = []
times_table = {}
for i in list(range(1,11)):
    for j in list(range(1,11)):
        answers.append(i * j)
    times_table[i] = answers
    answers = []

multiplication_table = pd.DataFrame(times_table)
multiplication_table.index += 1
multiplication_table

    1   2   3   4   5   6   7   8   9    10
1    1   2   3   4   5   6   7   8   9   10
2    2   4   6   8  10  12  14  16  18   20
3    3   6   9  12  15  18  21  24  27   30
4    4   8  12  16  20  24  28  32  36   40
5    5  10  15  20  25  30  35  40  45   50
6    6  12  18  24  30  36  42  48  54   60
7    7  14  21  28  35  42  49  56  63   70
8    8  16  24  32  40  48  56  64  72   80
9    9  18  27  36  45  54  63  72  81   90
10  10  20  30  40  50  60  70  80  90  100

In [60]:
spreads = ['butter', 'jam', 'peanut butter']
toppings = ['ham', 'cheese', 'sardines']

filling = []
combinations = {}

for spread in spreads:
    for topping in toppings:
        filling.append(f'{spread} {topping}')
    combinations[spread] = filling
    filling = []

sandwiches_df = pd.DataFrame(combinations)
sandwiches_df['topping'] = toppings

sandwiches_df = sandwiches_df[['topping', 'butter', 'jam', 'peanut butter']] #removes pivot table look by defining columns to show
sandwiches_df

    topping           butter           jam           peanut butter
0       ham       butter ham       jam ham       peanut butter ham
1    cheese    butter cheese    jam cheese    peanut butter cheese
2  sardines  butter sardines  jam sardines  peanut butter sardines